[
    {
        "id": 893333,
        "title": "Netizens demand Chikkaballapur-Cantontment MEMU service be resumed",
        "content": "Netizens are calling for the resumption of the Chikkaballapur-Bengaluru Cantonment MEMU train service, which South Western Railway (SWR) discontinued in January 2025 due to low occupancy rates (below 2%). Citizens, particularly from northern Bengaluru, argue that the service is crucial for easing traffic congestion and providing better connectivity to the Metro and IT hubs like Whitefield. Bengaluru Central MP PC Mohan has also urged SWR to restart the trains, highlighting their potential to reduce pressure on routes like Hebbal and the Outer Ring Road. Despite this public demand, SWR stated that no proposals for restoring the MEMU service have been received so far.",
        "author": "Ankitha",
        "username": "anki_tha"
    },
    {
        "id": 89323,
        "title": "Rolls-Royce sets up its largest global tech innovation hub in Bengaluru",
        "content": "Rolls-Royce has announced the launch of its largest Global Capability & Innovation Centre (GCIC) in the world right here in Bengaluru, marking a major milestone in its India operations. Located in the Manyata Embassy Business Park, this new centre spans 700 seats and will serve as a key hub for the company’s engineering, enterprise services, and digital technology teams. It also houses a newly created Data Labs unit that will focus on advanced analytics, artificial intelligence, and automation to support Rolls-Royce’s global business lines, including aerospace, defence, and energy. The company said the decision to base this flagship facility in Bengaluru reflects the city’s deep tech talent pool and thriving innovation ecosystem. With this move, Rolls-Royce is aiming to build stronger local supply chains, co-develop technology with Indian partners, and drive faster product innovation for its global markets, further cementing Bengaluru’s reputation as a strategic tech powerhouse.",
        "author": "Demo User 1",
        "username": "user1"
    },
    {
        "id": 1783022,
        "title": "Big office lease: BlackRock takes space on MG Road",
        "content": "BlackRock Services India, the Indian arm of the world’s largest asset manager, has just signed a massive office lease deal in the heart of Bengaluru’s Central Business District. The company has taken up around 1.43 lakh square feet of space spread across the ground and five upper floors of IndiQube Symphony at KNG Tower 1 on MG Road. The agreement, which kicks in from October 1, 2025, is for a period of 10 years and is reportedly valued at over ₹410 crore in rent alone. BlackRock will pay around ₹2.72 crore each month, at a rental rate of about ₹190 per square foot, and has also put down a security deposit of ₹21.75 crore. The lease comes with a standard 5% annual escalation clause. This deal underlines how global financial firms are continuing to bet big on Bengaluru’s commercial real estate, especially in the premium CBD stretch, even as IndiQube itself looks to rapidly expand its managed office portfolio across India.",
        "author": "Demo User 2",
        "username": "user2"
    },
    {
        "id": 8992452,
        "title": "Mini-library on wheels: books in an auto",
        "content": "A three-wheeled autorickshaw in Bengaluru is turning commutes into literary breaks. One driver has created a “library on wheels” inside his auto, with thought-provoking spiritual and philosophical books available for riders to read (or borrow) free of charge. The sign reads “Free for all, take if you wish.” So next time you’re stuck in traffic, you might read “Why Divorce?” or reflect on “God Loves You” — all while on your way home. Many are calling it a beautiful example of creativity in everyday life in Bengaluru.",
        "author": "Demo User 3",
        "username": "user3"
    },
    {
        "id": 5639363,
        "title": "Auto-rides + Kannada lessons, all in one",
        "content": "Here’s a driver doing more than just ferrying passengers: one autorickshaw has become a mobile mini-classroom. Called “Learn Kannada with Auto Kannada Guy,” this auto has printed basic Kannada words with English translations, giving non-Kannada speakers a chance to pick up a few local phrases during the ride. It’s simple, sweet, and already going viral. Commuters love learning “hello,” “thank you,” and other everyday phrases while stuck in traffic — all thanks to this creative auto driver.",
        "author": "Ankitha",
        "username": "anki_tha"
    },
    {
        "id": 9873563,
        "title": "Visvesvaraya Museum becomes “Fun City” for its 60th birthday",
        "content": "To celebrate turning 60, the famous Visvesvaraya Industrial and Technological Museum in Bengaluru has given its galleries a refresh—now rebranded as Fun City. The revamp includes interactive, playful exhibits (think light, sound, illusion experiments), immersive displays, and newer installations so that science doesn’t feel like a lecture. Over 350 exhibits across eight galleries, half brand new. The museum expects this change to make it more appealing especially to kids, families, and anyone who wants a fun day out learning something new. Oh, and from August, ticket price bumped just a little.",
        "author": "Demo User 1",
        "username": "user1"
    },
    {
        "id": 768934773,
        "title": "“Frustrated Engineers Chai Point” goes viral",
        "content": "A small chai stall in Koramangala has captured hearts with its cheeky name: Frustrated Engineers Chai Point. What makes it special isn’t just the chai but the branding. In a city known for long hours and tech stress, this tea joint is making fun of the grind instead of adding to it. Social media users are loving it. One commented, “Chai is like sauna therapy in Bengaluru,” while another quipped, “The IT capital runs on caffeine and code.” It’s not clear whether actual engineers run it, but either way, the nod to Bengaluru’s tech hustle is unmistakable — and delicious.",
        "author": "Demo User 2",
        "username": "user2"
    },
    {
        "id": 42435543,
        "title": "Bengaluru water cut alert: BWSSB to shut down Cauvery supply for 3 days, asks people store water",
        "content": "The Bangalore Water Supply and Sewerage Board (BWSSB) has announced a significant three-day shutdown of the Cauvery water supply in Bengaluru from September 15 to 17, 2025. This measure is necessary to conduct critical emergency maintenance work at multiple pumping stations that are part of the Cauvery Water Supply Project. The disruption will affect several areas across the city, prompting authorities to urge residents to store sufficient water in advance to manage the outage. Citizens are advised to check the affected locations, specific timings, and take required precautions to minimize inconvenience during this maintenance period.",
        "author": "Demo User 3",
        "username": "user3"
    }
]